// Завдання 1: Дано масив, використовуючи цикл "for in" виведіть на консоль всі індекси цього масиву
function printIndexes(array) {
for (const a in array)  // Проходимося по всіх індексах масиву
  console.log(a)// Виводимо кожен індекс на консоль
}

console.log("Завдання 1 ====================================");
printIndexes([1, 2, 3, 4, 5]);
// Виведе
// 0
// 1
// 2
// 3
// 4

// Завдання 2: Дано масив, використовуючи цикл "for in" знайдіть суму всіх елементів масиву
function sumArray(array) {
  let sum = 0// Ініціалізуємо змінну для зберігання суми
  for (const a of array) {// Проходимося по всіх індексах масиву
    sum += a// Додаємо кожен елемент до загальної суми
  }
  return sum// Повертаємо суму
}

console.log("Завдання 2 ====================================");
console.log("sumArray([1, 2, 3, 4, 5])", sumArray([1, 2, 3, 4, 5])); // Виведе 15

// Завдання 3: Дано масив, використовуючи цикл "for of" знайдіть добуток всіх елементів масиву
function multiplyArray(array) {
  let mult = 1// Ініціалізуємо змінну для зберігання добутку
  for (const a of array) {// Проходимося по всіх значеннях масиву
  mult *= a// Множимо кожен елемент на загальний добуток
  } 
  return mult// Повертаємо добуток
}

console.log("Завдання 3 ====================================");
console.log("multiplyArray([1, 2, 3, 4, 5])", multiplyArray([1, 2, 3, 4, 5])); // Виведе 120

// Завдання 4: Дано масив рядків. Видаліть третій елемент масиву та перетворіть в рядок за допомогою методу toString(). Результат виведіть на консоль.
function modifyArray(array) {
  delete array[2]// Видаляємо третій елемент масиву
  console.log(array.toString())// Виводимо масив перетворений в рядок
}

console.log("Завдання 4 ====================================");
modifyArray([1, "two", 3, "four", 5]); // Виведе 1,two,,four,5

// Завдання 5: Дано масив рядків. За допомогою циклу for переберіть масив, виведіть кожен елемент 
//на консоль у верхньому регістрі.
function printUppercase(array) {
  for (const a of array) {// Проходимося по всіх елементах масиву
  console.log(a.toUpperCase())// Перетворюємо кожен елемент в верхній регістр та виводимо на консоль
}}

console.log("Завдання 5 ====================================");
printUppercase(["one", "two", "three"]); // Виведе ONE TWO THREE

// Завдання 6: Функція приймає деструктуризований масив чисел де буду перший елемент та масив всіх інших.
// За допомогою циклу for переберіть масив, знайдіть мінімальне та максимальне значення. Результат виведіть на консоль.
function findMinMax([firstElement, ...restElements]) {
  let minValue = restElements[0]
  let maxValue = restElements[0]// Ініціалізуємо змінні для мінімального та максимального значень, задаємо їм перше значення масиву
  for (const a of restElements) {// Перебираємо масив починаючи з другого елементу
  if (a < minValue) {minValue = a}// Перевіряємо, чи поточний елемент менший за мінімальне значення
  // Якщо так, оновлюємо мінімальне значення
  if (a > maxValue) {maxValue = a}// Перевіряємо, чи поточний елемент більший за максимальне значення
  // Якщо так, оновлюємо максимальне значення
  }
  console.log(`min: ${minValue} max: ${maxValue}`)// Виводимо мінімальне та максимальне значення
}

console.log("Завдання 6 ====================================");
findMinMax([5, 2, 8, 1, 9, 3]); // Виведе Min: 1 Max: 9

// Завдання 7: Функція приймає масив рядків.
// Перетворіть масив в рядок за допомогою методу toString() та повторіть його 2 рази. Результат виведіть на консоль.
function printStrings(array) {
  let textString = array.toString()// Перетворюємо масив в рядок і видаляемо пробіли та виводимо його на консоль
  console.log(textString + textString)
}

console.log("Завдання 7 ====================================");
printStrings([1, "two", 3, "four", 5]); // 1,two,3,four,51,two,3,four,5

// Завдання 8: Функція приймає масив рядків.
// За допомогою методу toString() перетворіть масив в рядок, та виясніть чи є в цьому рядку 
//підрядок subString .

function concatenateStrings(array, subString) {
  // Використовуємо метод toString() для перетворення масиву в рядок
  console.log((array.toString().includes(subString)))//Перевіряємо чи містить рядок підрядок
  // Виводимо результат
}

console.log("Завдання 8 ====================================");
concatenateStrings([1, "two", 3, "four", 5], "two"); // Виведе true

// Завдання 9: Функція приймає масив чисел.
// За допомогою циклу for-in переберіть масив, додайте до кожного елемента 10.
// Зберігайте результат в новому масиві. Результат виведіть на консоль.
function addTenToEach(array) {
  let arrayPlus = Array(array.length)// Ініціалізуємо масив через конструктор з такою же кількістю елементів як в вхідному масиві для зберігання результату
  for (const a in array) {// Перебираємо масив за допомогою циклу for-in
   arrayPlus[a] = array[a] + 10// Додаємо до поточного елемента 10 та додаємо результат в новий масив
  }
  console.log(arrayPlus)// Виводимо результат
}

console.log("Завдання 9 ====================================");
addTenToEach([5, 10, 15, 20]); // Виведе [15, 20, 25, 30]

// Завдання 10: Створити функцію, яка приймає масив чисел як аргумент.
function swapMinMax(array) {
  let max = array[0]
  let min = array[0]// Ініціалізуємо дві змінні (max і min) з першим елементом масиву. Ці змінні будуть використовуватися для зберігання максимального та мінімального значень в масиві.
  let maxIndex = 0 
  let minIndex = 0// Ініціалізуємо дві змінні (maxIndex і minIndex) з нульового значення. Ці змінні будуть використовуватися для зберігання індексів максимального та мінімального значень в масиві.
  for (let i = 0; i < array.length; i++) {// Використовуємо цикл for для ітерації по масиву. Починаємо з першого елемента (i = 0) і продовжуємо до останнього елемента масиву (i < array.length).
  if (array[i] > max) {
    max = array[i]
    maxIndex = i// Умова if перевіряє, чи є поточний елемент масиву більшим за поточне максимальне значення. Якщо це так, оновлюємо max з поточним елементом масиву та maxIndex з поточним індексом.
  }
  if (array[i] < min) {
    min = array[i]
    minIndex = i// Умова else if перевіряє, чи є поточний елемент масиву меншим за поточне мінімальне значення. Якщо це так, оновлюємо min з поточним елементом масиву та minIndex з поточним індексом.
  }
}
  [array[minIndex], array[maxIndex]] = [array[maxIndex], array[minIndex]]// Застосовуємо деструктуризацію масиву для обміну місцями мінімального та максимального значення в масиві.
  return array// Функція повертає масив, в якому мінімальне та максимальне значення обміняні місцями.
}

console.log("Завдання 10 ====================================");
// Виводимо в консоль результат виклику функції swapMinMax з масивом [1, 2, 3, 4, 5] як аргументом. Очікуємо бачити [5, 2, 3, 4, 1], оскільки максимальне та мінімальне значення обміняні місцями.
console.log(swapMinMax([1, 2, 3, 4, 5]));

// Завдання 11: Функція приймає масив чисел. Поверніть новий масив, який містить тільки парні числа з оригінального масиву.
function getEvenNumbers(arr) {
  let arrEven = []// Створюємо пустий масив для зберігання результату
  for (const a of arr) {// Проходимо через кожен елемент вхідного масиву
   if (a % 2  == 0) {// Перевіряємо чи є число парним
   arrEven = [...arrEven, a]}// Якщо так, додаємо його до масиву результату
  }
  return arrEven// Повертаємо масив результату
}
console.log("Завдання 11 ====================================");
console.log(getEvenNumbers([1, 2, 3, 4, 5, 6])); // Виведе [2, 4, 6]

// Завдання 12: Функція приймає масив чисел. Поверніть новий масив, в якому всі числа помножені на їх індекс.
function multiplyByIndex(arr) {
  let arrMult = []// Створюємо пустий масив для зберігання результату
  for (const a in arr) {// Проходимо через кожен елемент вхідного масиву
    arrMult[a] = arr[a] * a// Помножуємо число на його індекс і додаємо до масиву результату
  }
  return arrMult// Повертаємо масив результату
}
console.log("Завдання 12 ====================================");
console.log(multiplyByIndex([1, 2, 3, 4, 5])); // Виведе [0, 2, 6, 12, 20]

// Завдання 13: Функція приймає масив чисел. Повертає новий масив, в якому всі числа 
//більші за 10 замінені на рядок "Greater than 10", а 
// решта чисел замінені на рядок "Less than or equal to 10".
function replaceNumbers(arr) {
  let arrMod = []// Створюємо пустий масив для зберігання результату
  for (const a of arr) {// Проходимо через кожен елемент вхідного масиву
  if (a > 10) {// Перевіряємо, чи число більше за 10
  arrMod = [...arrMod, "Greater than 10"]// Якщо число більше за 10, додаємо рядок "Greater than 10" до масиву результату
  }
  if (a <= 10) {
    arrMod = [...arrMod, "Less than or equal to 10"]// Якщо число менше або дорівнює 10, додаємо рядок "Less than or equal to 10" до масиву результату
  }
  }
  return arrMod// Повертаємо масив результату
}

console.log("Завдання 13 ====================================");
console.log(replaceNumbers([5, 10, 15, 20])); // Виведе ["Less than or equal to 10", "Less than or equal to 10", "Greater than 10", "Greater than 10"]
